Documents/Продажа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Продажа</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтоговаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Продажа/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиентеПроцедура ТоварыКоличествоПриИзменении(Элемент)    ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;    Если ТекущаяСтрока = Неопределено Тогда        Возврат;    КонецЕсли;    ТекущаяСтрока.Сумма =        ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;    ПересчитатьИтог();КонецПроцедуры&НаКлиентеПроцедура ТоварыЦенаПриИзменении(Элемент)    ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;    Если ТекущаяСтрока = Неопределено Тогда        Возврат;    КонецЕсли;    ТекущаяСтрока.Сумма =        ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;    ПересчитатьИтог();КонецПроцедуры  

&НаСервереБезКонтекстаФункция ПолучитьЦенуТовара(Товар)    Если НЕ ЗначениеЗаполнено(Товар) Тогда        Возврат 0;    КонецЕсли;    Возврат Товар.Цена;КонецФункции&НаКлиентеПроцедура ПересчитатьИтог()    Объект.ИтоговаяСумма = 0;    Для Каждого СтрокаТовара Из Объект.Товары Цикл        Объект.ИтоговаяСумма =            Объект.ИтоговаяСумма + СтрокаТовара.Сумма;    КонецЦикла;КонецПроцедуры

&НаСервереФункция ПечатьНаСервере()    ТабДок = Новый ТабличныйДокумент;    Макет = Документы.Продажа.ПолучитьМакет("ПечатьПродажи");    ОбластьШапка = Макет.ПолучитьОбласть("Шапка");    ОбластьШапка.Параметры.Номер = Объект.Номер;    ОбластьШапка.Параметры.Дата = Объект.Дата;    ОбластьШапка.Параметры.Клиент = Объект.Клиент;    ТабДок.Вывести(ОбластьШапка);    ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");    ТабДок.Вывести(ОбластьШапкаТаблицы);    ОбластьСтрокаТовара = Макет.ПолучитьОбласть("СтрокаТовара");    Для Каждого СтрокаТовара Из Объект.Товары Цикл        ОбластьСтрокаТовара.Параметры.Товар = СтрокаТовара.Товар;        ОбластьСтрокаТовара.Параметры.Количество = СтрокаТовара.Количество;        ОбластьСтрокаТовара.Параметры.Цена = СтрокаТовара.Цена;        ОбластьСтрокаТовара.Параметры.Сумма = СтрокаТовара.Сумма;        ТабДок.Вывести(ОбластьСтрокаТовара);    КонецЦикла;    ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");    ОбластьПодвал.Параметры.ИтоговаяСумма = Объект.ИтоговаяСумма;    ТабДок.Вывести(ОбластьПодвал);    Возврат ТабДок;КонецФункции
&НаКлиенте
Процедура Печать(Команда)
	ТабДок = ПечатьНаСервере();    
	ТабДок.Показать("Продажи");
КонецПроцедуры
